### <font color="brown">Pandas - DataFrame Continued</font>

In [1]:
import numpy as np
import pandas as pd
from pandas import Series
from pandas import DataFrame

---

#### <font color="brown">Working with NaNs</font>

#### Remove rows/columns with NaNs using dropna

In [2]:
from numpy import nan as NA
datf = DataFrame([[1, 3.8, 2.1],
                  [2, NA, NA],
                  [NA, NA, NA],
                  [NA, 4.8, 1.7]])
datf

     0    1    2
0  1.0  3.8  2.1
1  2.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  4.8  1.7

**Drop rows that have an NaN in any column**

In [3]:
datf.dropna()

     0    1    2
0  1.0  3.8  2.1

In [4]:
datf

     0    1    2
0  1.0  3.8  2.1
1  2.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  4.8  1.7

Original is not modified, use `inplace=True` to modify original

In [5]:
datf1 = datf.copy()
datf1.dropna(inplace=True)
datf1

     0    1    2
0  1.0  3.8  2.1

In [6]:
# to do the same with columns, pass axis=1
datf.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

**To drop only those rows/columns that have NaN in ALL columns**

In [7]:
# drop rows that have NaNs in all columns
datf.dropna(how='all')

     0    1    2
0  1.0  3.8  2.1
1  2.0  NaN  NaN
3  NaN  4.8  1.7

In [8]:
# drop rows that have NaNs in all columns
datf.dropna(how='all',axis=1)  # none of the columns are entirely NAs

     0    1    2
0  1.0  3.8  2.1
1  2.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  4.8  1.7

#### Filling NaNs with values

**Replace all NaNs with single value**

In [9]:
datf

     0    1    2
0  1.0  3.8  2.1
1  2.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  4.8  1.7

In [10]:
datf.fillna(0)

     0    1    2
0  1.0  3.8  2.1
1  2.0  0.0  0.0
2  0.0  0.0  0.0
3  0.0  4.8  1.7

**Replace all NaNs in row or column using ffill (forward fill)**

In [11]:
# column-wise
datf.fillna(method='ffill')

     0    1    2
0  1.0  3.8  2.1
1  2.0  3.8  2.1
2  2.0  3.8  2.1
3  2.0  4.8  1.7

In [12]:
datf   # original not modified

     0    1    2
0  1.0  3.8  2.1
1  2.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  4.8  1.7

In [13]:
# row-wise
datf.fillna(method='ffill',axis=1)

     0    1    2
0  1.0  3.8  2.1
1  2.0  2.0  2.0
2  NaN  NaN  NaN
3  NaN  4.8  1.7

**Replace all NaNs in multiple columns using dictionary**

In [14]:
datf.fillna({1: 2.5, 2: 1.5})

     0    1    2
0  1.0  3.8  2.1
1  2.0  2.5  1.5
2  NaN  2.5  1.5
3  NaN  4.8  1.7

In [15]:
datf

     0    1    2
0  1.0  3.8  2.1
1  2.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  4.8  1.7

**Treat column/row separately as Series, and use fillna**

In [16]:
# column as Series and fillna
datf[2].fillna(1.5)

0    2.1
1    1.5
2    1.5
3    1.7
Name: 2, dtype: float64

In [17]:
# row as Series, and fillna inplace
datfc = datf.copy()
datfc.loc[2].fillna(-1,inplace=True)
datfc

     0    1    2
0  1.0  3.8  2.1
1  2.0  NaN  NaN
2 -1.0 -1.0 -1.0
3  NaN  4.8  1.7

---
#### <font color="brown">One way to deal with missing numeric data is to replace with mean</font>

In [18]:
mpgfile = open("auto_mpg_original.csv")
mpgs = pd.read_csv(mpgfile)
mpgs

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name
0,18.0,8.0,307.0,130.0,3504.0,12.0,70.0,1.0,chevrolet chevelle malibu
1,15.0,8.0,350.0,165.0,3693.0,11.5,70.0,1.0,buick skylark 320
2,18.0,8.0,318.0,150.0,3436.0,11.0,70.0,1.0,plymouth satellite
3,16.0,8.0,304.0,150.0,3433.0,12.0,70.0,1.0,amc rebel sst
4,17.0,8.0,302.0,140.0,3449.0,10.5,70.0,1.0,ford torino
...,...,...,...,...,...,...,...,...,...
401,27.0,4.0,140.0,86.0,2790.0,15.6,82.0,1.0,ford mustang gl
402,44.0,4.0,97.0,52.0,2130.0,24.6,82.0,2.0,vw pickup
403,32.0,4.0,135.0,84.0,2295.0,11.6,82.0,1.0,dodge rampage
404,28.0,4.0,120.0,79.0,2625.0,18.6,82.0,1.0,ford ranger
405,31.0,4.0,119.0,82.0,2720.0,19.4,82.0,1.0,chevy s-10

In [19]:
mpgs['mpg'].mean()

23.514572864321607

In [20]:
mpgs2 = mpgs.copy()

In [21]:
mpgs2[mpgs2['mpg'].isnull()]

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name
10,NaN,4.0,133.0,115.0,3090.0,17.5,70.0,2.0,citroen ds-21 pallas
11,NaN,8.0,350.0,165.0,4142.0,11.5,70.0,1.0,chevrolet chevelle concours (sw)
12,NaN,8.0,351.0,153.0,4034.0,11.0,70.0,1.0,ford torino (sw)
13,NaN,8.0,383.0,175.0,4166.0,10.5,70.0,1.0,plymouth satellite (sw)
14,NaN,8.0,360.0,175.0,3850.0,11.0,70.0,1.0,amc rebel sst (sw)
17,NaN,8.0,302.0,140.0,3353.0,8.0,70.0,1.0,ford mustang boss 302
39,NaN,4.0,97.0,48.0,1978.0,20.0,71.0,2.0,volkswagen super beetle 117
367,NaN,4.0,121.0,110.0,2800.0,15.4,81.0,2.0,saab 900s

##### **Use fillna method on relevant column (Series)**

In [22]:
mpgs2['mpg'] = mpgs2['mpg'].fillna(mpgs2['mpg'].mean())

In [23]:
mpgs2.loc[10:14]

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name
10,23.514573,4.0,133.0,115.0,3090.0,17.5,70.0,2.0,citroen ds-21 pallas
11,23.514573,8.0,350.0,165.0,4142.0,11.5,70.0,1.0,chevrolet chevelle concours (sw)
12,23.514573,8.0,351.0,153.0,4034.0,11.0,70.0,1.0,ford torino (sw)
13,23.514573,8.0,383.0,175.0,4166.0,10.5,70.0,1.0,plymouth satellite (sw)
14,23.514573,8.0,360.0,175.0,3850.0,11.0,70.0,1.0,amc rebel sst (sw)

In [24]:
mpgs[mpgs['horsepower'].isnull()]

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name
38,25.0,4.0,98.0,NaN,2046.0,19.0,71.0,1.0,ford pinto
133,21.0,6.0,200.0,NaN,2875.0,17.0,74.0,1.0,ford maverick
337,40.9,4.0,85.0,NaN,1835.0,17.3,80.0,2.0,renault lecar deluxe
343,23.6,4.0,140.0,NaN,2905.0,14.3,80.0,1.0,ford mustang cobra
361,34.5,4.0,100.0,NaN,2320.0,15.8,81.0,2.0,renault 18i
382,23.0,4.0,151.0,NaN,3035.0,20.5,82.0,1.0,amc concord dl

In [25]:
mpgs2['horsepower'] = mpgs2['horsepower'].fillna(mpgs2['horsepower'].mean())

In [26]:
mpgs2.loc[[38,133]]

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name
38,25.0,4.0,98.0,105.0825,2046.0,19.0,71.0,1.0,ford pinto
133,21.0,6.0,200.0,105.0825,2875.0,17.0,74.0,1.0,ford maverick

In [27]:
mpgs2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 406 entries, 0 to 405
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   mpg           406 non-null    float64
 1   cylinders     406 non-null    float64
 2   displacement  406 non-null    float64
 3   horsepower    406 non-null    float64
 4   weight        406 non-null    float64
 5   acceleration  406 non-null    float64
 6   model year    406 non-null    float64
 7   origin        406 non-null    float64
 8   car name      406 non-null    object
dtypes: float64(8), object(1)
memory usage: 28.7+ KB

---

#### <font color="brown">General data frame manipulation</font>

**Column returned on indexing is a VIEW, so modifications will affect underlying dataframe column**

In [28]:
rand2d = np.random.random((3,2))
rand2d

array([[0.966194  , 0.01256808],
       [0.11878615, 0.47857962],
       [0.04746416, 0.46773709]])

In [29]:
randdf = DataFrame(rand2d, index=['one', 'two', 'three'],
                   columns = ['first', 'second'])
randdf

          first    second
one    0.966194  0.012568
two    0.118786  0.478580
three  0.047464  0.467737

In [30]:
col2 = randdf['second']
col2

one      0.012568
two      0.478580
three    0.467737
Name: second, dtype: float64

In [31]:
col2 += 0.05
print(col2,'\n')
print(randdf)

one      0.062568
two      0.528580
three    0.517737
Name: second, dtype: float64

          first    second
one    0.966194  0.062568
two    0.118786  0.528580
three  0.047464  0.517737

In [32]:
# if you don't want this, make an explicit copy of the returned column series
randdf['second'] -= 0.05
randdf

          first    second
one    0.966194  0.012568
two    0.118786  0.478580
three  0.047464  0.467737

In [33]:
col2 = randdf['second'].copy()
col2 += 0.05
print(col2,'\n')
print(randdf)

one      0.062568
two      0.528580
three    0.517737
Name: second, dtype: float64

          first    second
one    0.966194  0.012568
two    0.118786  0.478580
three  0.047464  0.467737

#### Adding dataframes together

In [34]:
rand2d = np.random.random((3,3))
randdf2 = DataFrame(rand2d, index=['one', 'two', 'four'],
                   columns = ['first', 'second', 'third'])
randdf2

         first    second     third
one   0.099053  0.105470  0.161406
two   0.279110  0.002957  0.750849
four  0.667910  0.105989  0.060192

In [35]:
randdf

          first    second
one    0.966194  0.012568
two    0.118786  0.478580
three  0.047464  0.467737

In [36]:
randdf + randdf2   # NaN will be used if either of a pair of aligned values is missing

          first    second  third
four        NaN       NaN    NaN
one    1.065247  0.118038    NaN
three       NaN       NaN    NaN
two    0.397896  0.481537    NaN

**Note that indexes are arranged in lexicographic order**

---

#### <font color="brown">Function Application and Mapping</font>

##### <font color="brown">apply, for Series objects of DataFrame (columns or rows)</font>

In [37]:
df = DataFrame(np.random.randn(4,3),columns=list("ABC"),index=["One","Two","Three",'Four'])
df

              A         B         C
One    1.983608  0.838435 -0.959365
Two    1.153072 -0.307072  1.370347
Three -1.548316  0.184700  0.142148
Four  -0.359806 -1.262488 -0.070010

In [38]:
dfabs = df.abs()
dfabs

              A         B         C
One    1.983608  0.838435  0.959365
Two    1.153072  0.307072  1.370347
Three  1.548316  0.184700  0.142148
Four   0.359806  1.262488  0.070010

**Function that rounds each item of a series that will be sent as parameter**

In [39]:
roundfn = lambda x: round(x,2)  # x is a Series

**Use apply method on dataframe with function as parameter, each column will be sent as argument to function**

In [40]:
dfabs.apply(roundfn)  # each column is sent in as an argument

          A     B     C
One    1.98  0.84  0.96
Two    1.15  0.31  1.37
Three  1.55  0.18  0.14
Four   0.36  1.26  0.07

In [41]:
dfabs  # original does not change

              A         B         C
One    1.983608  0.838435  0.959365
Two    1.153072  0.307072  1.370347
Three  1.548316  0.184700  0.142148
Four   0.359806  1.262488  0.070010

In [42]:
# or you can directly write the lambda as argument
dfabs.apply(lambda x: round(x,2))

          A     B     C
One    1.98  0.84  0.96
Two    1.15  0.31  1.37
Three  1.55  0.18  0.14
Four   0.36  1.26  0.07

In [43]:
# this makes it clear that apply is executed a column at a time (axis=0 is default)
dfabs.apply(lambda x: np.cumsum(x))

              A         B         C
One    1.983608  0.838435  0.959365
Two    3.136680  1.145508  2.329712
Three  4.684996  1.330208  2.471860
Four   5.044803  2.592695  2.541870

In [44]:
# you can define any function, not just lambdas
def roundsum(x):
    return round(np.cumsum(x),2)

In [45]:
dfabs.apply(roundsum)

          A     B     C
One    1.98  0.84  0.96
Two    3.14  1.15  2.33
Three  4.68  1.33  2.47
Four   5.04  2.59  2.54

In [46]:
dfabs

              A         B         C
One    1.983608  0.838435  0.959365
Two    1.153072  0.307072  1.370347
Three  1.548316  0.184700  0.142148
Four   0.359806  1.262488  0.070010

In [47]:
# a row at a time
dfabs.apply(roundsum,axis=1)

          A     B     C
One    1.98  2.82  3.78
Two    1.15  1.46  2.83
Three  1.55  1.73  1.88
Four   0.36  1.62  1.69

In [48]:
# of course, you can simply extract a column or row and send it 
dfabs['A'].apply(roundfn)

One      1.98
Two      1.15
Three    1.55
Four     0.36
Name: A, dtype: float64

In [49]:
# and if you are going to do this, you can use the Series map function
dfabs['B'].map(roundfn)

One      0.84
Two      0.31
Three    0.18
Four     1.26
Name: B, dtype: float64

In [50]:
dfabs

              A         B         C
One    1.983608  0.838435  0.959365
Two    1.153072  0.307072  1.370347
Three  1.548316  0.184700  0.142148
Four   0.359806  1.262488  0.070010

In [51]:
dfabs.loc['Two'].apply(roundfn)

A    1.15
B    0.31
C    1.37
Name: Two, dtype: float64

In [52]:
# since round is a Python function you can use it directly
dfabs.loc['Two'].round(2)

A    1.15
B    0.31
C    1.37
Name: Two, dtype: float64

In [53]:
dfabs

              A         B         C
One    1.983608  0.838435  0.959365
Two    1.153072  0.307072  1.370347
Three  1.548316  0.184700  0.142148
Four   0.359806  1.262488  0.070010

In [54]:
# for built-in Python functions, apply is generally unnecessary
dfabs.round(2)

          A     B     C
One    1.98  0.84  0.96
Two    1.15  0.31  1.37
Three  1.55  0.18  0.14
Four   0.36  1.26  0.07

In [55]:
# try mapping two rows
dfabs.loc[['Two','Three']].map(lambda x: round(x,2))

AttributeError: 'DataFrame' object has no attribute 'map'

In [ ]:
# won't work because the indexing gives a dataframe, so use apply
dfabs.loc[['Two','Three']].apply(lambda x: round(x,2))

---

##### <font color="brown">applymap, for one item of a DataFrame at a time</font>

In [ ]:
dfabs.applymap(lambda x: round(x,2))

In [ ]:
dfabs  # original not changed

In [ ]:
dfabs.applymap(lambda x: np.round(np.cumsum(x),2))

##### **each item is treated like an ndarray, so cumulative sum is trivially done on a single item**

---

#### <font color="brown">Iterating over rows and columns of DataFrame</font>

##### <font color="brown">Iterating over rows using iterrows</font>

In [ ]:
dfabs

In [ ]:
dfround = dfabs.round(2)
dfround

In [ ]:
for row in dfround.iterrows():
    print(row,'\n')

**Each row is returned as a tuple: first item is index label of row, second item is Series for row.<br>
For each row Series, its index are the column names, and values are values in that row**

In [ ]:
for row in dfround.iterrows():
    ser = row[1]
    print(ser.index)
    print(ser.values)
    print('\n')

In [ ]:
# retrieving column values individually
for row in dfround.iterrows():
    ser = row[1]
    for i,col in enumerate(ser.index):
        print(f'{col}: {ser.values[i]}')
    print('\n')

##### <font color="brown">Iterating over columns using iteritems</font>

In [ ]:
dfround

In [ ]:
for col in dfround.items():
    print(col)
    print('\n')

**Each column is returned as a tuple: first item is column name, second item is Series for column.<br>
For each Series, index is the row index, and values are values in that column**

---

---

#### <font color="brown">Grouping</font>

##### <font color="brown">Example 1a: State populations by year</font>

In [56]:
popdat = {'state': ['Arizona','Arizona','Arizona','Virginia','Virginia'],
          'year': [2005, 2010, 2015, 2010, 2015],
          'pop': [5.9, 6.6, 6.8, 7.9, 8.3]}
popdf = DataFrame(popdat)
popdf

      state  year  pop
0   Arizona  2005  5.9
1   Arizona  2010  6.6
2   Arizona  2015  6.8
3  Virginia  2010  7.9
4  Virginia  2015  8.3

In [1]:
# first group by year
yrgrp = popdf.groupby('year')
yrgrp

NameError: name 'popdf' is not defined

In [88]:
# then sum up within each group
df = yrgrp.sum()  # pop is the only numeric column, so sum applies to it
df

/var/folders/tc/ygfgqn3528zb8vd2wbw8s_pc0000gn/T/ipykernel_45723/2100586770.py:2: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df = yrgrp.sum()  # pop is the only numeric column, so sum applies to it

       pop  debt
year
2005   5.9   1.2
2010  14.5   2.1
2015  15.1   2.3

In [89]:
df.index.name

'year'

In [90]:
df.reset_index()  # so we can have year as a column

   year   pop  debt
0  2005   5.9   1.2
1  2010  14.5   2.1
2  2015  15.1   2.3

In [61]:
# in one shot
popdf.groupby('year').sum().reset_index()

/var/folders/tc/ygfgqn3528zb8vd2wbw8s_pc0000gn/T/ipykernel_45723/1500177329.py:2: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  popdf.groupby('year').sum().reset_index()

   year   pop
0  2005   5.9
1  2010  14.5
2  2015  15.1

##### <font color="brown">Example 1b: State populations and debt by year</font>

In [62]:
popdf['debt'] = Series([1.2,1.2,1.1,0.9,1.2])
popdf

      state  year  pop  debt
0   Arizona  2005  5.9   1.2
1   Arizona  2010  6.6   1.2
2   Arizona  2015  6.8   1.1
3  Virginia  2010  7.9   0.9
4  Virginia  2015  8.3   1.2

In [63]:
popdf.groupby('year').sum().reset_index()

/var/folders/tc/ygfgqn3528zb8vd2wbw8s_pc0000gn/T/ipykernel_45723/958097876.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  popdf.groupby('year').sum().reset_index()

   year   pop  debt
0  2005   5.9   1.2
1  2010  14.5   2.1
2  2015  15.1   2.3

**Group sum is computed for both numeric columns**

##### <font color="brown">Example 2a: School graduates by year</font>

In [64]:
grads = pd.read_csv(open('graduates.csv'))
grads

   Student School  Graduating Year       Major
0         Rutgers             2012          CS
1      Penn State             2011          EE
2       Princeton             2013  Psychology
3             MIT             2010     Physics
4         Rutgers             2018        Math
5      Penn State             2019   Economics
6             MIT             2017          CS
7      Penn State             2015     Biology
8         Rutgers             2013  Philosophy
9       Princeton             2012   Economics
10        Rutgers             2015   Economics
11      Princeton             2018          CS
12     Penn State             2015   Economics
13           Yale             2012          CS
14        Rutgers             2013  Psychology

**Q. How many grads in 2012?**

In [65]:
gdf = grads.groupby('Graduating Year').count()
gdf

                 Student School  Major
Graduating Year
2010                          1      1
2011                          1      1
2012                          3      3
2013                          3      3
2015                          3      3
2017                          1      1
2018                          2      2
2019                          1      1

**The count function applied to each group**

In [66]:
gdf.loc[2012]['Major']

3

##### <font color="brown">Example 2b: School graduates by major, and within each major, by year</font>

**Q. How many Econ grads in 2015?**

**2-level grouping, first by major, then by graduating year within major**

In [67]:
gdf2 = grads.groupby(['Major','Graduating Year']).count()
gdf2

                            Student School
Major      Graduating Year
Biology    2015                          1
CS         2012                          2
           2017                          1
           2018                          1
EE         2011                          1
Economics  2012                          1
           2015                          2
           2019                          1
Math       2018                          1
Philosophy 2013                          1
Physics    2010                          1
Psychology 2013                          2

In [68]:
gdf2.loc['Economics',2015]

Student School    2
Name: (Economics, 2015), dtype: int64

In [69]:
gdf2.loc['Economics']

                 Student School
Graduating Year
2012                          1
2015                          2
2019                          1

In [70]:
type(gdf2.loc['Economics',2015])

pandas.core.series.Series

In [71]:
gdf2.loc['Economics',2015]['Student School']

2

In [72]:
gdf2_reset = gdf2.reset_index()
gdf2_reset

         Major  Graduating Year  Student School
0      Biology             2015               1
1           CS             2012               2
2           CS             2017               1
3           CS             2018               1
4           EE             2011               1
5    Economics             2012               1
6    Economics             2015               2
7    Economics             2019               1
8         Math             2018               1
9   Philosophy             2013               1
10     Physics             2010               1
11  Psychology             2013               2

In [73]:
gdf2_reset[(gdf2_reset['Major'] == 'Economics') & (gdf2_reset['Graduating Year'] == 2015)]

       Major  Graduating Year  Student School
6  Economics             2015               2

In [74]:
ser = gdf2_reset[(gdf2_reset['Major'] == 'Economics') & (gdf2_reset['Graduating Year'] == 2015)]['Student School']
ser

6    2
Name: Student School, dtype: int64

In [75]:
ser.values[0]

2

##### <font color="brown">Example 2c: Value Counts</font>

**Q. What are the top majors by number of graduates?**

In [76]:
grads

   Student School  Graduating Year       Major
0         Rutgers             2012          CS
1      Penn State             2011          EE
2       Princeton             2013  Psychology
3             MIT             2010     Physics
4         Rutgers             2018        Math
5      Penn State             2019   Economics
6             MIT             2017          CS
7      Penn State             2015     Biology
8         Rutgers             2013  Philosophy
9       Princeton             2012   Economics
10        Rutgers             2015   Economics
11      Princeton             2018          CS
12     Penn State             2015   Economics
13           Yale             2012          CS
14        Rutgers             2013  Psychology

In [77]:
major_counts = grads['Major'].value_counts()
major_counts

CS            4
Economics     4
Psychology    2
EE            1
Physics       1
Math          1
Biology       1
Philosophy    1
Name: Major, dtype: int64

In [78]:
major_counts[major_counts == major_counts.max()]

CS           4
Economics    4
Name: Major, dtype: int64

In [79]:
major_counts[major_counts == major_counts.max()].index.tolist()

['CS', 'Economics']

**Note above that an index can be converted to a list with the tolist method**

---

---

#### <font color="brown">Dropping rows or columns (variation of del operation for column)</font>

In [80]:
nparr = np.random.random((4,3))
randdf = DataFrame(nparr,index=['four','one','three','two'],columns=['first','second','third'])
randdf

          first    second     third
four   0.756735  0.970216  0.718288
one    0.092211  0.706052  0.023081
three  0.210204  0.764715  0.234162
two    0.987114  0.647035  0.692237

**Dropping rows**

In [81]:
randdf2 = randdf.drop(['four','three'])
randdf2

        first    second     third
one  0.092211  0.706052  0.023081
two  0.987114  0.647035  0.692237

In [82]:
randdf

          first    second     third
four   0.756735  0.970216  0.718288
one    0.092211  0.706052  0.023081
three  0.210204  0.764715  0.234162
two    0.987114  0.647035  0.692237

**Original is not changed**

In [83]:
rfcopy = randdf.copy()
del rfcopy['second']
rfcopy

          first     third
four   0.756735  0.718288
one    0.092211  0.023081
three  0.210204  0.234162
two    0.987114  0.692237

**But del for deleting column changes original**

In [84]:
# trying to drop column "third"
randdf.drop(['third'])

KeyError: "['third'] not found in axis"

**To make drop work for column need to use axis=1**

In [ ]:
randdf.drop(['third'],axis=1)

In [ ]:
randdf

**Use inplace=True to modify original**

In [ ]:
rcopy = randdf.copy()
rcopy.drop(['three','four'],inplace=True)
rcopy